app/Controllers/Admin/GaransiServiceController.php

    public function index()
    {
        $garansiserviceModel = new GaransiSemuaServiceModel();
        // Get the garansi_motor value from the session
        $data['garansi_service'] = $garansiserviceModel->findAll();
---
SELECT *
FROM `garansi_semua_service`