app/Controllers/Admin/GaransiKompresorController.php

SELECT *
FROM `compressor_warranties`
---
    public function index()
    {
        $garansikompresorModel = new CompressorwarrantyModel();
        // Get the garansi_kompresor value from the session
        $data['garansi_kompresor'] = $garansikompresorModel->findAll();