app/Controllers/BaseController.php

SELECT *
FROM `users`
WHERE `users`.`id` = '1'
---
    public function __construct()
    {
        // Fetch the logged-in user's data if logged in
        $userModel = new UserModel();
        $userId = session()->get('id'); // Assuming 'user_id' is stored in the session
        if ($userId) {
            $this->user = $userModel->find($userId);