app/Controllers/CatalogController.php

SELECT *
FROM `subcategories`
WHERE `category_id` = '10'
---
public function getSubcategories()
{
    $categoryName = $this->request->getGet('category');  // Get category name from the filter

    // Get category_id based on the category name
    $categoryId = $this->getCategoryIdByName($categoryName);

    if ($categoryId) {
        // Fetch subcategories that belong to this category_id
        $subcategories = $this->subcategoryModel->where('category_id', $categoryId)->findAll();

SELECT *
FROM `categories`
WHERE `name` = 'TV'
 LIMIT 1
---
private function getCategoryIdByName($categoryName)
{
    $category = $this->categoryModel->where('name', $categoryName)->first();

SELECT *
FROM `subcategories`
WHERE `name` = 'ANALOG'
 LIMIT 1
SELECT *
FROM `categories`
WHERE `name` = 'SMALL APPLIANCES'
 LIMIT 1
---
private function getSubcategoryIdByName($subcategoryName)
{
    $subcategory = $this->subcategoryModel->where('name', $subcategoryName)->first();