app/Controllers/ProductController.php

SELECT *
FROM `subcategories`
WHERE `category_id` = '3'
---
    public function getSubcategories($categoryId)
    {
        $subcategoryModel = new SubcategoryModel();

        // Fetch subcategories based on categoryId
        $subcategories = $subcategoryModel->where('category_id', $categoryId)->findAll();

SELECT *
FROM `compressor_warranties`
---
    public function getCompressorWarranties()
    {
        $model = new CompressorWarrantyModel();
        $warranties = $model->findAll();

SELECT *
FROM `brands`
SELECT *
FROM `categories`
SELECT *
FROM `subcategories`
SELECT *
FROM `capacities`
SELECT *
FROM `compressor_warranties`
SELECT *
FROM `sparepart_warranties`
SELECT *
FROM `garansi_elemen_panas`
SELECT *
FROM `garansi_motor`
SELECT *
FROM `garansi_panel`
SELECT *
FROM `garansi_semua_service`
---
    public function step1()
    {
        $brandModel = new BrandModel();
        $categoryModel = new CategoryModel();
        $subcategoryModel = new SubcategoryModel();
        $capacityModel = new CapacityModel();
        $compressorwarrantyModel = new CompressorwarrantyModel();
        $sparepartwarrantyModel = new SparepartwarrantyModel();
        $garansiEPModel = new GaransiElemenPanasModel();
        $garansimotorModel = new GaransiMotorModel();
        $garansipanelModel = new GaransiPanelModel();
        $garansiserviceModel = new GaransiSemuaServiceModel();
        $ukuranModel = new UkuranModel();

        $data['brands'] = $brandModel->findAll();
        $data['categories'] = $categoryModel->findAll();
        $data['subcategories'] = $subcategoryModel->findAll();
        $data['capacities'] = $capacityModel->findAll();
        $data['compressor_warranties'] = $compressorwarrantyModel->findAll();
        $data['sparepart_warranties'] = $sparepartwarrantyModel->findAll();
        $data['garansi_elemen_panas'] = $garansiEPModel->findAll();
        $data['garansi_motor'] = $garansimotorModel->findAll();
        $data['garansi_panel'] = $garansipanelModel->findAll();
        $data['garansi_semua_service'] = $garansiserviceModel->findAll();