app/Controllers/ProductController.php

    public function fetchWarrantyOptions()
    {
        $type = $this->request->getGet('type');
        log_message('info', 'fetchWarrantyOptions type: ' . $type); // Debug log

        $model = null;
        switch ($type) {
            case 'garansi_panel':
                $model = new GaransiPanelModel();
                break;
            case 'garansi_motor':
                $model = new GaransiMotorModel();
                break;
            case 'garansi_kompresor':
                $model = new CompressorWarrantyModel();
                break;
            case 'garansi_elemen_panas':
                $model = new GaransiElemenPanasModel();
                break;
            case 'garansi_semua_service':
                $model = new GaransiSemuaServiceModel();
                break;
            default:
                return $this->response->setJSON(['error' => 'Invalid warranty type']);
        }

        if ($model) {
            $warranties = $model->findAll();
---
SELECT *
FROM `garansi_elemen_panas`
SELECT *
FROM `garansi_motor`
SELECT *
FROM `garansi_panel`
SELECT *
FROM `garansi_semua_service`

    public function getCapacities($subcategoryId)
    {
        log_message('info', 'getCapacities called with ID: ' . $subcategoryId);

        try {
            $capacityModel = new CapacityModel();
            $capacities = $capacityModel->where('subcategory_id', $subcategoryId)->findAll();
---
SELECT *
FROM `capacities`
WHERE `subcategory_id` = '21'