app/Models/ProductModel.php

    public function getProductData($productId)
    {
        return $this->select('products.*, brands.name as brand, categories.name as category, subcategories.name as subcategory, capacities.value as capacity, compressor_warranties.value as compressor_warranty, sparepart_warranties.value as sparepart_warranty')
            ->join('brands', 'products.brand_id = brands.id')
            ->join('categories', 'products.category_id = categories.id')
            ->join('subcategories', 'products.subcategory_id = subcategories.id')
            ->join('capacities', 'products.capacity_id = capacities.id')
            ->join('compressor_warranties', 'compressor_warranties.id = products.compressor_warranty_id', 'left')
            ->join('sparepart_warranties', 'sparepart_warranties.id = products.sparepart_warranty_id', 'left')
            ->join('garansi_elemen_panas', 'garansi_elemen_panas.id = products.garansi_elemen_panas_id', 'left')
            ->join('garansi_motor', 'garansi_motor.id = products.garansi_motor_id', 'left')
            ->join('garansi_panel', 'garansi_panel.id = products.garansi_panel_id', 'left')
            ->join('garansi_semua_service', 'garansi_semua_service.id = products.garansi_semua_service_id', 'left')
            ->join('ukuran_tv', 'ukuran_tv.id = products.ukuran_id', 'left')
            ->where('products.id', $productId)
            ->get() // Use `get()` to fetch the data
            ->getRowArray(); // Use `getRowArray()` to return a single row as an array
---
SELECT `products`.*, `brands`.`name` as `brand`, `categories`.`name` as `category`, `subcategories`.`name` as `subcategory`, `capacities`.`value` as `capacity`, `compressor_warranties`.`value` as `compressor_warranty`, `sparepart_warranties`.`value` as `sparepart_warranty`
FROM `products`
JOIN `brands` ON `products`.`brand_id` = `brands`.`id`
JOIN `categories` ON `products`.`category_id` = `categories`.`id`
JOIN `subcategories` ON `products`.`subcategory_id` = `subcategories`.`id`
JOIN `capacities` ON `products`.`capacity_id` = `capacities`.`id`
LEFT JOIN `compressor_warranties` ON `compressor_warranties`.`id` = `products`.`compressor_warranty_id`
LEFT JOIN `sparepart_warranties` ON `sparepart_warranties`.`id` = `products`.`sparepart_warranty_id`
LEFT JOIN `garansi_elemen_panas` ON `garansi_elemen_panas`.`id` = `products`.`garansi_elemen_panas_id`
LEFT JOIN `garansi_motor` ON `garansi_motor`.`id` = `products`.`garansi_motor_id`
LEFT JOIN `garansi_panel` ON `garansi_panel`.`id` = `products`.`garansi_panel_id`
LEFT JOIN `garansi_semua_service` ON `garansi_semua_service`.`id` = `products`.`garansi_semua_service_id`
LEFT JOIN `ukuran_tv` ON `ukuran_tv`.`id` = `products`.`ukuran_id`
WHERE `products`.`id` = 103